# Terminal
cask "ghostty"

# Editor
brew "neovim"
brew "lazygit"
brew "tree-sitter"
brew "fzf"
brew "ripgrep"
brew "fd"

# Multiplexer
brew "tmux"

# Prompt
brew "starship"

# Development tools
brew "fnm"
brew "rust" # cargo for idasen-control

# Utilities
brew "tree"

# System tools
cask "karabiner-elements"
cask "rectangle"

# Fonts
cask "font-jetbrains-mono-nerd-font"
