# Terminal
cask "ghostty"

# Editor
brew "neovim"
brew "lazygit"
brew "tree-sitter"
brew "fzf"
brew "ripgrep"
brew "fd"

# Multiplexer
brew "tmux"
# tokyo-night-tmux theme dependencies (https://github.com/janoamaral/tokyo-night-tmux)
brew "bash"
brew "bc"
brew "coreutils"
brew "gawk"
brew "gh"
brew "glab"
brew "gnu-sed"
brew "jq"
brew "nowplaying-cli"

# Prompt
brew "starship"

# Development tools
brew "fnm"
brew "just"

# Navigation: frecency cd + smart session manager (sesh uses zoxide + fzf)
brew "zoxide"
brew "sesh"
brew "rust" # cargo for idasen-control

# Utilities
brew "tree"

# System tools
cask "karabiner-elements"
cask "rectangle"

# Fonts
cask "font-jetbrains-mono-nerd-font"
# for tokyo-night-tmux glyphs
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
